app/controllers/doctor_controller.rb

INSERT INTO "doctors" ("first_name", "second_name", "gender", "city", "speciality", "consultaion_charges", "degree", "experience", "clinic_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@doctor = Doctor.new(params.permit(:first_name,:second_name,:gender,:city,
			:area,:speciality,:consultaion_charges,:degree,:experience,:clinic_name))
      	if @doctor.save

SELECT "doctors".* FROM "doctors"
---
	def list
	  	doctors = Doctor.all

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 3]]
---
  	def delete
      begin
      	doctor = Doctor.find(params[:id])
      	if doctor.destroy

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "doctors" SET "consultaion_charges" = ?, "clinic_name" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["consultaion_charges", "100"], ["clinic_name", "jai-ma-clinic"], ["updated_at", 2016-08-03 10:51:25 UTC], ["id", 1]]
---
  	def modify
	  doctor = Doctor.find(params[:id])

	  if doctor.update(params.permit(:first_name,:second_name,:gender,:city,
			:area,:speciality,:consultaion_charges,:degree,:experience,:clinic_name))

SELECT "doctors".* FROM "doctors" WHERE (first_name LIKE '%agam%')
---
	  def searchByName
		url = request.original_url

		begin

			prms = CGI.parse(URI.parse(url).query)

			results = Doctor.where("first_name LIKE ?", "%#{prms['name'][0]}%")

SELECT "doctors".* FROM "doctors" WHERE (gender LIKE '%m%')
---
	  def searchByGender
		url = request.original_url

		begin

			prms = CGI.parse(URI.parse(url).query)


			results = Doctor.where("gender LIKE ?", "%#{prms['gender'][0]}%")

SELECT "doctors".* FROM "doctors" WHERE (city LIKE '%d%')
---
	  def searchByCity
		url = request.original_url

		begin

			prms = CGI.parse(URI.parse(url).query)


			results = Doctor.where("city LIKE ?", "%#{prms['city'][0]}%")

SELECT "doctors".* FROM "doctors" WHERE (area LIKE '%%')
---
	  def searchByArea
		url = request.original_url

		begin

			prms = CGI.parse(URI.parse(url).query)


			results = Doctor.where("area LIKE ?", "%#{prms['area'][0]}%")

SELECT "doctors".* FROM "doctors" WHERE (speciality LIKE '%%')
---
	  def searchBySpeciality
		url = request.original_url

		begin

			prms = CGI.parse(URI.parse(url).query)


			results = Doctor.where("speciality LIKE ?", "%#{prms['speciality'][0]}%")

SELECT "doctors".* FROM "doctors" WHERE (experience LIKE '%neu%')
---
	  def searchByExperience
		url = request.original_url

		begin

			prms = CGI.parse(URI.parse(url).query)


			results = Doctor.where("experience LIKE ?", "%#{prms['experience'][0]}%")

SELECT "doctors".* FROM "doctors" WHERE (clinic_name LIKE '%years%')
---
	  def searchByClinic
		url = request.original_url

		begin

			prms = CGI.parse(URI.parse(url).query)


			results = Doctor.where("clinic_name LIKE ?", "%#{prms['clinic'][0]}%")